bit-finance/InformationRegisters/ДокументыОПредстоящейПоставке.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ДокументыОПредстоящейПоставке</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СуммаНалога</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>16</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Состояние</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СостояниеДОПП</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПланируемаяДатаВвоза</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КатегорияПодакцизногоТовара</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДатаСобытия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КБК</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НомерДОПП</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>13</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

bit-finance/Enums/СостояниеДОПП.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>СостояниеДОПП</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ПоставкаПроизошла</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоставкаОтменена</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

bit-finance/InformationRegisters/ДокументыОПредстоящейПоставке/Forms/ФормаЗаписи/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если ЗначениеЗаполнено(Параметры.Организация) Тогда
		Запись.Организация = Параметры.Организация;
		КодБКНДС = Параметры.КодБКНДС;
		Если ЗначениеЗаполнено(Параметры.КодыБК) Тогда
			ТаблицаКБК = ОбщегоНазначенияУТ.МассивВТаблицуЗначений(Параметры.КодыБК);
			КодыБК.Загрузить(ТаблицаКБК);
		КонецЕсли;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(КодБКНДС) Тогда
		СтатьиДоходовБюджетаРФ = ЕдиныйНалоговыйСчет.КБКПоВидамНалогов(ТекущаяДатаСеанса());
		КодБКНДСВидНалога = СтатьиДоходовБюджетаРФ.Получить(Справочники.ВидыНалоговВзносов.НДС_ВвозимыеТовары);
		КодБКНДС = РегистрыСведений.ДокументыОПредстоящейПоставке.УточнитьКБК(КодБКНДСВидНалога.Получить(0));
		
		КодыБК.Загрузить(РегистрыСведений.ДокументыОПредстоящейПоставке.ПолучитьКодыБК(КодБКНДС));
	КонецЕсли;
	
	УстановитьВидимость(Элементы.ДатаСобытия, Запись.Состояние);
		
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	Если ЗначениеЗаполнено(Запись.Состояние) И Не ЗначениеЗаполнено(Запись.ДатаСобытия) Тогда
	
		ОчиститьСообщения();
		Если Запись.Состояние = ПредопределенноеЗначение("Перечисление.СостояниеДОПП.ПоставкаОтменена") Тогда
			ТекстСообщения = НСтр("ru = 'Поле ""Дата отмены поставки"" не заполнено';
									|en = 'Поле ""Дата отмены поставки"" не заполнено'");
		Иначе
			ТекстСообщения = НСтр("ru = 'Поле ""Дата принятия к учету"" не заполнено';
									|en = 'Поле ""Дата принятия к учету"" не заполнено'");
		КонецЕсли;
		
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
		Возврат;
		
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Запись.Состояние) Тогда
		Запись.ДатаСобытия = Дата(1,1,1);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	// СтандартныеПодсистемы.УправлениеДоступом
	УправлениеДоступом.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	// СтандартныеПодсистемы.УправлениеДоступом
	УправлениеДоступом.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
	// Конец СтандартныеПодсистемы.УправлениеДоступом

КонецПроцедуры
#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура КБКНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Заголовок",          НСтр("ru = 'Выбор КБК';
														|en = 'Выбор КБК'"));
	ПараметрыФормы.Вставить("ТаблицаЗначений",    КодыБК);
	Если ЗначениеЗаполнено(Запись.КатегорияПодакцизногоТовара) Тогда
		ПараметрыФормы.Вставить("СтруктураДляПоиска", Новый Структура("Код", СокрЛП(Запись.КатегорияПодакцизногоТовара)));
	Иначе
		ПараметрыФормы.Вставить("СтруктураДляПоиска", Новый Структура("Код", КодБКНДС));
	КонецЕсли;
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ВыборКБКЗавершение", ЭтотОбъект);
	ОткрытьФорму("Обработка.ОбщиеОбъектыРеглОтчетности.Форма.ФормаВыбораЗначенияИзТаблицы",
		ПараметрыФормы,
		ЭтотОбъект,
		УникальныйИдентификатор, , ,
		ОписаниеОповещения,
		РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ОснованиеВключенияВДекларациюПриИзменении(Элемент)
	
	УстановитьВидимость(Элементы.ДатаСобытия, Запись.Состояние);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ВыборКБКЗавершение(РезультатВыбора, ДопПараметры) Экспорт
	
	Если РезультатВыбора = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Запись.КБК = РезультатВыбора.Код;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьВидимость(Элемент, Состояние)
	
	Элемент.Видимость = ЗначениеЗаполнено(Состояние);
	Если Состояние = ПредопределенноеЗначение("Перечисление.СостояниеДОПП.ПоставкаОтменена") Тогда
		Элемент.Заголовок = НСтр("ru = 'Дата отмены поставки';
								|en = 'Дата отмены поставки'");
	ИначеЕсли Состояние = ПредопределенноеЗначение("Перечисление.СостояниеДОПП.ПоставкаПроизошла") Тогда
		Элемент.Заголовок = НСтр("ru = 'Дата принятия к учету';
								|en = 'Дата принятия к учету'");
	КонецЕсли;

КонецПроцедуры

#КонецОбласти
